<script>
  import Pidor from "./pidor.svelte";
</script>

<p>
  Тяжело быть в IT, потому что все твои школьные друзья вообще не вдупляют, чем
  ты занимаешься. Программист, продакт-менеджер, QA —&nbsp;чем это всё
  отличается от починки принтера? (подсказка: за починку принтера не получаешь
  300k в секунду)
</p>
<p>
  С обычными людьми и об IT не поговорить, потому что этой индустрией
  пользуются, но её не понимают. Но есть одна тема, которую можно поднять с
  любым смертным и которая его заинтересует, которую он поймёт и которая взорвёт
  ему мозг: приватность данных.
</p>
<blockquote>
  <p>Дисклеймер:</p>
  <ul>
    <li>
      пост длинный. Но я разбавил его шутейками и картинками, чтобы клиповое
      мышление не умерло в агонии;
    </li>
    <li>
      если ты айтишник —&nbsp;ну штош, считай что ты забрёл в первый класс и
      изучаешь алфавит. Возможно, не узнаешь ничего нового; если узнаешь
      —&nbsp;это тревожный звоночек для твоего работодателя.
    </li>
  </ul>
</blockquote>
<p>
  Как за нами следят? Спасёт ли VPN и режим инкогнито? Может стоит вообще
  спаковать манатки и уехать в тайгу жить среди медведей?
</p>
<h2 id="часть-1-классификация-заболеваний">
  Часть 1: Классификация заболеваний
</h2>
<p>
  В каком-то смысле право на частную жизнь консолидирует все остальные права: на
  голосование, свободу самовыражения, равные возможности и так далее. Достаточно
  потерять право на частую жизнь и всё, тобi пiзда. Большинство людей влёгкую
  попадают в ловушку мышления
  <em>"Мне нечего скрывать, какое мне дело до приватности?"</em>
  . Распространённая ошибка. Беспокоиться надо не о том, что ты хочешь скрыть, а
  о том, что ты даже не думаешь скрывать.
</p>
<p>
  Тема настолько обширная, что пришлось придумать свою категоризацию. Я долго
  над этим думал (минут 10, не меньше) и пришёл к такой мысли: самое важное
  —&nbsp;это очевидность того, кто хранит данные пользователя, что это за данные
  и как ими манипулируют. Выходит три переменных: актор, данные, манипуляция.
  Всего-то трёхмерная матрица —&nbsp;помнишь, я писал, что даже тупой поймёт
  суть статьи? Не помнишь? Я тоже. Видимо, не писал.
</p>
<p>Актор:</p>
<ol>
  <li>
    <strong>непосредственный получатель</strong>
    . Когда вводишь поисковый запрос в Google, Google в курсе, что ты ввёл.
    Теперь ты об этом знаешь. Не за что.
  </li>
  <li>
    <strong>теневой получатель</strong>
    . Хочется думать, что когда ты зашёл на мой блог, об этом узнал только я
    —&nbsp;и то, кто ты такой мне неизвестно. Но на самом деле об этом узнал,
    блять, весь мир просто. Ты еще даже не скачал с торрентов "Он вам не Димон",
    а отдел К уже пробивает, какую туалетку ты покупаешь, чтобы на ней шрифтом
    Брайля передать угрозы твоей жопе.
  </li>
</ol>
<p>Данные:</p>
<ol>
  <li>
    <strong>то, что ты сознательно отдаёшь</strong>
    . Твою историю просмотров на PornHub не утаить от самого PornHub, так что в
    мире кое-кто знает, какой ты изврат.
  </li>
  <li>
    <strong>то, что ты не хотел бы отдавать</strong>
    . Ммм, еще одно приложение, которое превращает твоё селфи в лицо няшного
    пса? Что, просит доступ к фотогалерее? Конечно разрешить, не вижу ничего
    плохого… [проходит три минуты] Поздравляю, приложение знает
    <strong>историю твоих перемещений</strong>
    , а также
    <strong>может загрузить сохранить к себе все твои нудесы</strong>
    . Надеюсь, твоя пёсья морда того стоила.
  </li>
</ol>
<p>Манипуляция:</p>
<ol>
  <li>
    <strong>хранение</strong>
    . Само по себе хранение не плохо, но ничего хорошего тоже не сулит, потому
    как легко ведёт к двум следующим пунктам.
  </li>
  <li>
    <strong>вычисление</strong>
    . Если включить фантазию (и немного паранойи), то вы все обосрётесь от
    перспектив в этом вычисления. Пока достаточно знать, что по вашим действиям
    Facebook знает вашу
    <a
      href="https://www.newscientist.com/article/2161442-facebook-may-guess-millions-of-peoples-sexuality-to-sell-ads/"
      target="_blank">
      сексуальную ориентацию
    </a>
    ,
    <a
      href="https://adage.com/article/digital/facebook-pregnant/237073"
      target="_blank">
      может предвидеть вашу беременность
    </a>
    ,
    <a
      href="https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0215476"
      target="_blank">
      угадать, чем вы больны
    </a>
    , и многое другое. В целом, Facebook знает о твоей жизни больше, чем родные
    родители, а возможно даже и ты сам.
  </li>
  <li>
    <strong>продажа</strong>
    . Не все акторы этим занимаются, но, увы, интернет по большей части строится
    на рекламе, а реклама —&nbsp;это уже отточенный механизм передачи данных о
    клиенте.
  </li>
  <li>
    <strong>проёб или слив</strong>
    . Ой, ребят, когда до этого дойдём, я специально включу камеру на твоём
    ноуте, чтобы заснять твоё охуевшее лицо.
  </li>
</ol>
<p>
  Некоторые из пунктов так и просят какого-то объяснения (и оно будет!), потому
  что у неокрепших умов пользователей почему-то возникает мысль, что Большие
  Корпорации не такие уж мудацкие и точно желают человечеству добра. Штош, если
  ты так тоже думаешь, разочарование будет болезненным.
</p>
<h2 id="часть-2-акторы">Часть 2: Акторы</h2>
<p>
  Начнём сверху вниз. Комплюктеры связываются между собой по Великой
  Интернет-Сети, а общаются они с помощью Волшебных Запросов. Поэтому чтобы
  понять угрозы сперва разберём то, как работает Волшебный Запрос.
</p>
<pre>
  <code>
    Тут надо вставить картинку, которая объясняет флоу запроса девайс -&gt; DNS
    девайс -&gt; провайдер -&gt; ДЦ -&gt; сервер итоговая страница -&gt; ???
  </code>
</pre>
<p>
  Когда ты заходишь на чей-то блог, ты совершаешь запрос. Запрос не идёт линейно
  к целевой машине, а проходит через несколько промежуточных пунктов. На каждом
  из этих промежуточных пунктов нас подстерегают опасности.
</p>
<blockquote>
  <p>
    Схема суперпростая, её соответствие реальности —&nbsp;где-то 60%, но и ты,
    если верить британским учёным,
    <a
      href="https://www.getscience.com/biology-explained/how-genetically-related-are-we-bananas"
      target="_blank">
      на 60% банан
    </a>
    , так что для интересующихся почитайте матчасть (
    <a
      href="https://habr.com/ru/company/htmlacademy/blog/254825/"
      target="_blank">
      ру
    </a>
    ,
    <a href="https://github.com/alex/what-happens-when" target="_blank">англ</a>
    ).
  </p>
</blockquote>
<h3 id="девайс-→-dns">Девайс → DNS</h3>
<p>
  Машины привыкли между собой адресовать запросы по т.н. ip-адресам —&nbsp;той
  непонятной херне, которую тебе настраивают безрукие спецы от твоего
  интернет-провайдера, а потом записывают на бумажке со словами "ток не
  потеряйте" (бумажку вы выбрасываете сразу же, конечно). Выглядят они как
  четыре числа, разделённые точками, например 127.0.0.1.
</p>
<p>
  <em>
    Еще хоть один чёрт придёт ко мне в личку с рассказом про ipv6, я за себя не
    ручаюсь.
  </em>
</p>
<p>
  Вот когда вы открываете мой уютный бложек, вы ж вводите не числа, а домен.
  Буквенный. Понятный. Всё это удобство благодаря штуке под названием DNS
  (Domain Name Server, Домен Имя Сервер, понятно всё?). Он переводит понятный
  людям адрес (dkzlv.ru) в понятный машине (127.0.0.1 — РКН, баньте, я не
  против).
</p>
<p>
  Вот мы и узнали первую течь: DNS. Почти все безрукие спецы провайдеров
  настраивают вам DNS-сервера вашего же провайдера. "Для скорости" — говорят
  они. "Где-то тут зарыта выгода" — читаем мы.
</p>
<p>
  Использование DNS-серверов вашего провайдера означает, что вы будете ходить к
  ним и узнавать, какой ip-адрес у какого домена. Кроме того, что это открывает
  прекрасный мир блокировок неугодных сайтов (об этом в другой раз, мои
  либерально-ватниковые друзья), это еще сообщает провайдеру о том, что вы точно
  посещали какой-то сайт.
</p>
<p>
  <strong>Решение</strong>
  : использовать независимые зарубежные DNS-сервера.
  <a href="/setup-dns" target="_blank">Гайд по настройке тут</a>
  , это в буквальном смысле ввести набор чиселок в поле ввода в настройках.
</p>
<h3 id="девайс-→-провайдер-→-дц-→-сервер">Девайс → провайдер → ДЦ → сервер</h3>
<p>
  Есть два типа соединений: защищённое и незащищённое. О незащищённых вам
  сообщит браузер, если он у вас не древний как говно мамонта. Если он не
  древний, как
  <a href="https://ru.wikipedia.org/wiki/Чёрный_носорог" target="_blank">
    говно чёрного носорога
  </a>
  , возможно браузер даже вас настоятельно попросит одуматься и не пользоваться
  таким сайтом.
</p>
<pre>
  <code>
    Вставить пикчу про незащищённое соединение: например, что-то про вскрытые
    конверты и правку сообщений от агентов КГБ
  </code>
</pre>
<p>
  Если видите сообщение про незащищённое соединение, лучше вообще закрыть
  страницу и ничего с ней не делать. Поверьте, с точки зрения информационной
  безопасности это хуже, чем заниматься незащищённым сексом с партнёром, у
  которого от гениталий расходятся радиальные красные полосы.
</p>
<p>
  При незащищённом соединении нет никаких уязвимостей, кроме одной небольшой:
  любой посредник имеет полный контроль над всем, что вы принимаете или
  посылаете, то есть это полное отсутствие безопасности. Мобильные операторы,
  например,
  <a
    href="https://tjournal.ru/tech/62611-pochemu-megafon-bessovestno-pokazyvaet-reklamu-na-chuzhih-saytah"
    target="_blank">
    вставляют на незащищённые сайты
  </a>
  свою полноэкранную рекламу без ведома владельца сайта.
</p>
<p>
  Так что поговорим про защищённое соединение. Чтобы ты мог блеснуть перед
  бабушками у подъезда знаниями, дам краткий ликбез в криптографию (нет, с
  криптовалютами не связано) и работу сети.
</p>
<p>
  Если ты не PhD по криптографии и не запускал свои ICO, достаточно знать, что
  существует два типа шифрования: симметричное и ассиметричное. По простому, в
  симметричном для шифрования и расшифровки используется одинаковый ключ. В
  ассиметричном одним ключом ты зашифровываешь —&nbsp;его часто называют
  <strong>приватным</strong>
  или
  <strong>закрытым</strong>
  — а вторым ключом&nbsp;расшифровываешь —&nbsp;его называют
  <strong>публичным</strong>
  или
  <strong>открытым</strong>
  . Никто не знает, какая там математика замешана (как никто не знает, почему
  такие на вид тяжёлые самолёты летят по небу), но некоторые алгоритмы
  шифрования взломать почти невозможно.
</p>
<p>
  Вот для защищённого соединения используются оба типа шифрования. Чтоб ты не
  заснул, я оформил эту процедуру в виде пьесы.
</p>
<blockquote>
  <p>
    <strong>Действующие лица</strong>
    :
  </p>
  <p>
    <strong>Озгюр</strong>
    : молодой турок, которого женщины мира единогласно решили воздержать от
    секса.
  </p>
  <p>
    <strong>Нина</strong>
    : русская девушка, которую я добавил сюда для полноты картины.
  </p>
  <p>
    <strong>Телефон Озгюра</strong>
    : устройство, отправляющее сообщения.
  </p>
  <p>
    <strong>Pinder</strong>
    : сервис, где принято писать похабные сообщения.
  </p>
  <p>
    <strong>Сервер Pinder</strong>
    : сервер, принимающий сообщения.
  </p>
  <p>
    <strong>Акт 1</strong>
  </p>
  <p>
    <em>Озгюр долго печатает Нине в Pinder</em>
  </p>
  <p>
    <strong>Телефон Озгюра</strong>
    (
    <em>обращается к серверу Pinder</em>
    ): Дарова, брат. Мой ублюдок хочет написать сообщение. Давай сделаем всё
    по-чистому, защищённо. Я умею в HTTPS.
  </p>
  <p>
    <strong>Сервер Pinder</strong>
    : Дарова, брат. Понятно, соболезную. Мои ублюдки дадут ему отправить
    сообщение, но потом покажи ему тридцать баннеров с рекламой. Я тоже в умею в
    HTTPS. План такой, короче: во-первых, я тебе пришлю мой публичный ключ, и
    все дальнейшие сообщения ты будешь шифровать им, чтоб нас никто не
    подслушивал. Во-вторых, пришли мне какую-нибудь белиберду, чтобы я из неё
    сделал симметричный ключ. Ведь симметричное шифрование, дорогой читатель,
    работает намного быстрее ассиметричного.
  </p>
  <p>
    <em>Четвертая стена рушится</em>
  </p>
  <p>
    <em>Сервер Pinder присылает публичный ключ</em>
  </p>
  <p>
    <em>Телефон Озгюра и Сервер Pinder жмут руки</em>
  </p>
  <p>
    <strong>Телефон Озгюра</strong>
    : Твой публичный ключ хорош. Лады, вот тебе моя белиберда. Я из этой
    белиберды сгенерирую себе симметричный ключ. Выглядит он
    <em>примерно так</em>
    .
  </p>
  <p>
    <em>
      Телефон Озгюра присылает зашифрованную белиберду и примерный вид ключа
    </em>
  </p>
  <p>
    <strong>Сервер Pinder</strong>
    : Ок, я смог расшифровать, и правда херня какая-то. Окей, тоже сгенерирую
    симметричный ключ. Готово. Мой ключ выглядит
    <em>примерно так же</em>
    . Значит всё ок? Я кончил.
  </p>
  <p>
    <strong>Телефон Озгюра</strong>
    (
    <em>закуривает сигарету</em>
    ): я тоже кончил.
  </p>
  <p>
    <em>
      Всё дальнейшее общение Телефон Озгюра и Сервер Pinder шифруют симметричным
      ключом
    </em>
  </p>
  <p>
    <strong>Акт 2</strong>
  </p>
  <p>
    <strong>Озгюр</strong>
    (
    <em>закончил печатать</em>
    ): даш писку ебат.
  </p>
  <p>
    <strong>Конец</strong>
  </p>
</blockquote>
<p>
  Некоторые детали я для простоты опустил (центры сертификации, хэши
  симметричного ключа и т.д.). Особо заинтересованные задроты могут почитать про
  TLS handshake всё в той же статье про работу сети (
  <a
    href="https://habr.com/ru/company/htmlacademy/blog/254825/"
    target="_blank">
    ру
  </a>
  ,
  <a href="https://github.com/alex/what-happens-when" target="_blank">англ</a>
  ).
</p>
<pre>
  <code>
    - вставить картинку про агента КГБ, который просто говорит "блять"
  </code>
</pre>
<p>
  При защищённом соединении все посредники всё равно видят, на какой сервер вы
  обращаетесь (ip-адрес), но этой информации мало для сколь угодно нормального
  анализа, поскольку весь информационный поток зашифрован для каждого
  пользователя индивидуально. Наверняка есть какие-то сложные и неточные
  эвристики для определения хотя бы типа контента — например, если ты уже 10
  минут что-то качаешь с хоста pornhub.com, скорее всего, провайдер знает, что
  это схемы для вязания крючком — но о них беспокоиться не стоит, они неточные.
</p>
<p>
  <strong>Решение</strong>
  : помните про
  <del>незащищённый секс</del>
  незащищённое соединение, там всё идет чистым текстом: данные карт, контент,
  адреса, поля формы, фотографии… Увидите плашку —&nbsp;просто закройте сайт. В
  2019 (AND RISING) году просто стыдно не уметь в HTTPS, считайте, что вас по
  умолчанию такие сайты хотят обуть —&nbsp;глядишь, мир станет чуть безопаснее.
</p>
<h3 id="итоговая-страница-→-">Итоговая страница → ???</h3>
<p>
  А вот теперь мы подходим к самой страшной части моего опуса. Всё,
  происходившее до этого момента —&nbsp;это щютки, потому что именно на этой
  стадии нас ждёт минное поле в четыре слоя. Даже лучшие из нас на этой стадии
  обсираются на постоянной основе.
</p>
<p>
  Как вы уже могли догадаться, магии в комплюктерах нет. Если вскрыть этот
  гнойный нарыв, за каждым неудобным и тупым решением мы всегда найдём команду,
  которая по итогу в шоке от того, как её технологию используют. Если почитаете
  спецификации SMTP/POP3 (та штука, которая даёт вам чудо электронной почты), вы
  поразитесь количеству малопонятных костылей.
</p>
<p>
  За любым общением двух машин стоят запросы. Отправка ваших нудесов незнакомцам
  в интернете — это тоже общение, даже если это за вас автоматически без вашего
  ведома делает программа. И с итоговой страницей, которая показывается в
  браузере, самая большая проблема в том, что она умеет эти запросы тоже
  отправлять.
</p>
<h4 id="анатомия-запроса">Анатомия запроса</h4>
<pre>
  <code>Нагуглить байку про создание cookies</code>
</pre>
<p>
  В бородатые годы ребята поняли, что нужно придумать костыль, который позволит
  клиенту между запросами сохранять состояние корзины покупок в
  интернет-магазине. Как обычно, дорога в ад всегда вымощена благими
  намерениями. Тогда и были придуманы те самые cookies, о которых в последние
  годы нас постоянно предупреждают сайты.
</p>
<p>Кукис —&nbsp;это большущая строка такого вида:</p>
<pre>
  <code>PRIVET=1823746587; POKA=ABCDEFG123_123; BLAHBLAH=1234ASLDKJNKJ;</code>
</pre>
<p>
  Было решено, что сервер может просить браузер сохранять эту строчку текста в
  отношении к конкретному хосту, и когда браузер посылает все дальнейшие
  запросы, он обязуется прикладывать к запросу сохранённые кукисы. Процедура
  простая:
</p>
<ol>
  <li>ты вводишь логин и пароль на сайте заказа проституток</li>
  <li>
    сервер проверяет, что всё ок, придумывает несуразную строчку текста (вроде
    <code>1bd5f794-9a91-4fc5-8858-d51a77486573</code>
    ), и запоминает, что тот, кто знает эту секретную строчку текста, тот ты
  </li>
  <li>эту строчку сервер просит браузер запомнить в виде кукис</li>
  <li>все дальнейшие запросы на этот сайт браузер шлёт с этой строчкой</li>
</ol>
<p>
  Вот и всё, мы имеем однозначную и безошибочную идентификацию, и состояние
  корзины не сбрасывается между запросами. Проблема решена, да, но шрапнелью
  зацепило и нашу приватность.
</p>
<p>
  Так в какой момент Google узнаёт о твоих предпочтениях в порно? Сейчас
  разберёмся —&nbsp;мы переходим к стадии галопирующего роста интернет-рекламы.
</p>
<h4 id="javascript-и-динамизм">JavaScript и динамизм</h4>
<p>
  На заре интернетов страницы были статичные. Ты что-то скачивал, оно
  показывалось, и если что-то двигалось, то это всегда была убогая вырвиглазная
  гифка. В остальном, если какая-то страница скачивалась, она просто одиноко
  отображалась без изменений годами. Это было уныло, людям хотелось динамизма.
  Поэтому для браузеров придумали и стандартизовали язык программирования
  <del>Cmm</del>
  <del>CEnvi</del>
  <del>Mocha</del>
  <del>LiveScript</del>
  <del>JScript</del>
  JavaScript. Он даёт тот самый динамизм. Что это такое? Например, вот, нажми на
  эту кнопку:
</p>

<Pidor />

<p>
  Вот тогда, давным давно, еще в прошлом тысячелетии, возможности правильно и
  неожиданно оскорбить прохожего в интернете не было, поэтому её решили
  добавить. JavaScript —&nbsp;это полноценный язык программирования, и на каждой
  странице любому разработчику много чего доступно. Без вашего разрешения он
  может посылать запросы на любые сервера в мире, хранить в браузере между
  открытиями страницы кучу информации, обращаться к акселерометру и гироскопу,
  следить за всеми нажатиями клавиш на клавиатуре. С разрешением —&nbsp;слать
  пуши, читать геолокацию, работать с вашей файловой системой ("Проводник"
  —&nbsp;для бабушек на Windows, Finder —&nbsp;для илиты на Mac), работать с
  USB-портами, Bluetooth, считывать данные с камеры и микрофона. Словом, кучу
  всего, смотрите
  <a href="https://whatwebcando.today" target="_blank">здесь</a>
  .
</p>
<p>
  Но нас больше всего интересует часть про отправку запросов. Любая страница
  может обратиться куда угодно. Вот простой пример:
</p>
<pre>
  <code>Сделать демо с поисковиком фильмов.</code>
</pre>
<p>
  Когда вы обращаетесь с поисковым запросом с моего блога на сервера IMDB, IMDB
  получает несколько вещей:
</p>
<ol>
  <li>поисковый запрос, иллюстрирующий твой херовый вкус в кино;</li>
  <li>
    набор кукис, относящийся к сайту IMDB. И тут сразу забавная тема: если кукис
    нет, IMDB их назначит, даже без твоего логина и пароля, ты не будешь
    привязан ни к какому пользователю, но будешь привязан к некоему анонимному
    пользователю, и в дальнейшем IMDB про тебя будет знать; если кукис есть —
    IMDB тебя узнает.
  </li>
</ol>
<p>
  Да-да. Я слил тебя IMDB. Ты дал согласие? Нет. Ты знал заранее? Нет. Могу я
  это сделать тихо без каких-либо полей ввода и кнопок "Поиск"? Да нехер делать.
</p>
<h4 id="скрипты">Скрипты</h4>
<p>
  Скрипты. Скрипты везде. Скрипты в твоём телефоне, в холодильнике и телевизоре,
  в вибраторе и духовке, в автоматической оконной роллете и ротационном
  рекламном баннере, в поезде метро и опять в вибраторе. Они везде. В моём блоге
  тоже.
</p>
<p>Немного истории веба.</p>
<p>
  До повальной адаптации поисковиков существовали каталоги. Ну вот открыл ты
  браузер в 1999 году, куда идти, что делать? Гугла нет. Правильно, надо идти в
  каталоги. Это были модерируемые людьми наборы сайтов, на которых ты мог
  узнать, где стоит узнать, чо там у хохлов, а где можно поиграть в онлайн-нарды
  с онлайн-армянами. Чтобы как-то сортировать сайты по популярности, создатели
  каталогов придумали предлагать разработчикам сайтов встраивать свои счётчики
  —&nbsp;выглядят они как убогие неуместные картинки с писькомером от создателя
  сайта, показывающие количество посетителей посетителей и уникальных
  посетителей. Уже тогда разработчики продали вас с потрохами, потому что эти
  счётчики по сути открывали картинку с сайта каталога. Это — запрос. Запрос
  отсылает кучу данных на сервер. Сервер вас узнаёт. Вы в жопе, все знают, что у
  вас есть фетиш на нарды с армянами. Теперь каталог знает, сколько уникальных
  посетителей у сайта, и по этим данным сортирует каталог. Вуаля!
</p>
<p>
  Потом пришли поисковики, и всё стало внезапно сложнее. Поисковик сам посещает
  сайты, скачивает все страницы и осуществляет по ним поиск. Главный вопрос
  такой: как ему понять, что из 20М страниц по запросу "как совиршить суецыд" он
  посоветовал самый лучший результат?
  <del>
    <em>Ответ: в идеале пользователь должен пропасть с радаров</em>
  </del>
  . В отличие от каталога, он не знает, как себя ведёт пользователь на странице,
  не знает, как часто тот туда приходит. Ему не на что опираться.
</p>
<h3 id="кто-этот-теневой-получатель">Кто этот Теневой получатель?</h3>
<p>
  Поисковики не знали, как улучшить результаты поиска. Тогда Google и пришёл к
  абсолютно гениальному решению.
</p>
<p>
  Google нужны данные с сайтов. Нужно каким-то образом на этот сайт поставить
  свой скрипт. Как? Дать что-то сверхинтересное для разработчика. В 2003 году
  они запустили AdSense — свою площадку для размещаемой контекстной рекламы. Эта
  площадка позволяла разработчику сайта зарабатывать с просмотров баннеров на
  своём сайте, достаточно было только разместить один малюсенький скрипт.
  Маленький шаг для компании, огромный пиздос для человечества.
</p>
<p>
  Вторым шагом был запуск Google Analytics. Помимо денег все разработчики хотели
  всё больше и больше знать о том, как пользователи ведут себя на сайтах: какие
  страницы посещают, сколько там проводят времени, как быстро и в каких
  направлениях отваливаются. Google запустил бесплатный сервис веб-аналитики для
  всех: "просто встрой скрипт, пожалуйста, не тяни, делай, я хочу обмазаться
  твоими данными" —&nbsp;томно шептал на ухо Google всем разработчикам вокруг.
</p>
<p>
  Согласно
  <a
    href="https://trends.builtwith.com/analytics/Google-Analytics"
    target="_blank">
    BuiltWith
  </a>
  , из миллиона самых популярных сайтов в мире 68% имеют Google Analytics. Из
  10k самых популярных — 88%. У
  <a href="https://trends.builtwith.com/ads/Google-Adsense" target="_blank">
    AdSense
  </a>
  пенетрация поменьше —&nbsp;16% и 33% соответственно. Ты под колпаком, чудило.
  Знаю, твои ладошки вспотели, стало страшно и немного спёрло дыхание. Я хочу,
  чтобы ты, дорогой читатель, обосрался, поэтому сообщу тебе то, чего ты боишься
  больше всего:
  <a href="https://arxiv.org/abs/1907.06520" target="_blank">93% порносайтов</a>
  имеют встроенные скрипты. Google знает, что ты любишь то, что в твоей стране
  осуждается.
</p>
<p>
  Нет-нет, не поймите меня неверно, Google не единственные, кто этим промышляет.
  <a
    href="https://trends.builtwith.com/analytics/Facebook-Pixel"
    target="_blank">
    40% топ 10k сайтов имеют трекинговый скрипт Facebook
  </a>
  . Automattic (компания, о которой ты вообще никогда не слышал) разработала
  движок Wordpress, они же предлагают у себя этот сайт разместить; суммарная
  посещаемость —&nbsp;
  <a href="https://ru.wordpress.com/activity/" target="_blank">
    полмиллиарда человек в месяц
  </a>
  . Видите крутую плавающую кнопку с лайками поста? Это может быть скрипт ребят
  из AddThis, у которых
  <a href="https://trends.builtwith.com/widgets/AddThis" target="_blank">
    26% из топ 10k сайтов
  </a>
  . Видите красивые стильные иконки на сайте? Есть вероятность, что на сайте
  стоит скрипт
  <a href="https://fontawesome.com/" target="_blank">FontAwesome</a>
  ,
  <a href="https://trends.builtwith.com/widgets/Font-Awesome" target="_blank">
    встроенный на 46% тех же сайтов
  </a>
  .
</p>
<p>
  Вы всего этого не знаете, а оно так. Если встраивается скрипт, скрипт может
  делать всё, что может делать JavaScript. Главным образом, конечно, посылать
  запросы, рассказывая своему создателю обо всём, что видит.
</p>
<h4 id="решение">Решение</h4>
<p>
  Ты пока не знаешь, почему весь этот сбор данных плох, но, просто поверь, что
  ты бы хотел его остановить. Он не в твоих интересах.
</p>
<p>
  Я вижу несколько вариантов. Самый простой и пока работающий сейчас
  —&nbsp;пользоваться
  <a href="https://brave.com/" target="_blank">браузером Brave</a>
  . Он по сути идентичен браузеру Chrome, только в нём нет рук Google, это
  частная компания, во главе, кстати, с одним из создателей языка JavaScript
  Бренданом Эйхом. Плюсов несколько:
</p>
<ul>
  <li>
    в браузер встроен хороший блокировщик всего этого описанного дерьма. Это не
    гарантирует тебе защиту от трекеров, и некоторые данные всё равно будут
    утекать, но кратно, кратно меньше;
  </li>
  <li>
    у браузера открытый исходный код, то есть ты можешь пойти и
    <a href="https://github.com/brave" target="_blank">почитать код</a>
    , который заставляет браузер работать. В идеале это значит, что в него не
    получится встроить говна, не обратив на это внимание сообщества.
  </li>
</ul>
<p>
  Молю, не пользуйся расширениями в браузере. Это полная дыра, об этом еще будет
  пост.
</p>
<h3 id="как-же-приложения">Как же приложения?</h3>
<p>
  Я осознанно опустил в статье всё, связанное с обычными приложениями на
  смартфоны и программами на компьютеры. Они пришли несколько позже, когда
  махина сбора данных уже работала в полную силу, поэтому эти новые платформы
  строились изначально с нагибанием приватности в уме. Там всё кратно хуже:
</p>
<ol>
  <li>
    без специального софта нет способа запретить приложению доступ в сеть
    целиком или избирательно;
  </li>
  <li>
    без специального софта нет способа посмотреть, состав запросов, которые
    приложение посылает; если установить этот софт (Charles, например),
    приложение может это узнать (читайте про SSL pinning), а значит тесты по
    определению чистыми не будут;
  </li>
  <li>
    приложения на iOS, Linux, Mac и Windows компилируются в нечитаемый байткод,
    а приложения на Android видоизменяются до почти что нечитаемого состояния.
    Узнать, что происходит внутри приложения практически невозможно или безумно
    сложно;
  </li>
  <li>
    всем приложениям без разбора доступна высокоточная идентификация клиента по
    рекламному ID. Идентификация, в отличие от сайтов, работает между
    приложениями;
  </li>
  <li>
    обе самых популярных платформы принадлежат техногигантам, которые, как мы
    выяснили выше, не очень заинтересованы в сохранении приватности;
  </li>
  <li>
    приложения имеют возможность в тихом режиме запускаться в фоне без вашего
    ведома и делать хрен знает что вообще.
  </li>
</ol>
<p>
  Всех этих проблем нет у сайтов. Приложения еще более закрыты и еще больше
  подтвержены этим загнивающим практикам мониторинга пользователей.
</p>
<pre>
  <code>
    поискать данные про builtwith, но с SDK: сколько приложений имеет firebase,
    сколько приложений имеет crashlytics/microsoft сборщик, сколько onesignal,
    facebook sdk и так далее.
  </code>
</pre>
<p>
  Вся остальная статья же актуальна и для приложений, но механизмы там чуть-чуть
  отличаются, зависят от платформы и их имплементация скрыта, поэтому так
  подробно у меня расписать не выйдет, я не так хорош. Проблемы с сбором данных
  имеется и в приложениях, только по этой проблеме еще меньше информации и
  исследований. Словно бы у кого-то (КХЕ-КХЕ, ГУГЛ, КХА-КХА, ЭППЛ) есть
  бизнес-интерес вставлять эти палки в колёса.
</p>
<h2 id="заключение">Заключение</h2>
<p>
  Наивный мой пирожочек, ты думаешь, что знаешь хоть что-нибудь в этом мире? Ты
  еще даже не у входа в заветную пещеру наслаждения, ты как Тарантино, только
  пальцы ног пососал. Самое сладенькое будет дальше. Представь, что это квест.
  Ты —&nbsp;самый злой мудак на планете, и ты выяснил, что можешь собирать
  данные.
</p>
<p>
  В следующей статье мы разберём коварный план по сбору данных. Узнаем, что
  можно выяснить по твоим лайкам, сообщениям маме, паттернам покупки в
  интернет-магазинах и так далее. Спойлер алёрт: всё, вплоть до истории твоих
  перемещений за время.
</p>
<pre>
  <code>концовка смазана</code>
</pre>
